.data
num: .word
msg: .asciiz "Enter a number"
msg2: .asciiz "Your number is: "
.text
.globl main
	main:
	
	li $v0, 4	#εμφανιζω το μηνυμα
	la $a0, msg
	syscall
#1----------------------------------------------------------------------------------------------------------------------	
	li $v0, 5	#ετοιμασου να διαβασεις integer
	syscall
#2----------------------------------------------------------------------------------------------------------------------
	sw $v0, num	#διαβασε τον Integer και αποθηκευσε τον στο $v0

	li $v0, 11
	li $a0, '\n'	#τυπωσε \n
	syscall
	
	li $v0, 4	
	la $a0, msg2	#τυπωσε το msg
	syscall
#3---------------------------------------------------------------------------------------------------------------------		
	li $v0, 1	
	lw $a0, num	#τυπωσε τον αριθμο αποθηκευμενο στο num
	syscall
	
	li $v0, 10
	syscall
	